In [5]:
import pandas as pd

friends=[{'age':15,'job':'student'},
        {'age':25,'job':'developer'},
        {'age':30,'job':'teacher'}]
df=pd.DataFrame(friends,
               index=['John','Jenny','Nate'],
               columns=['age','job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [7]:
df.drop(['John','Nate'])

       age        job
Jenny   25  developer

In [8]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [10]:
df=df.drop(['John','Nate'])
df

       age        job
Jenny   25  developer

In [11]:
df

       age        job
Jenny   25  developer

In [12]:
friends=[{'age':15,'job':'student'},
        {'age':25,'job':'developer'},
        {'age':30,'job':'teacher'}]
df=pd.DataFrame(friends,
               index=['John','Jenny','Nate'],
               columns=['age','job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [13]:
df.drop(['John','Nate'],inplace=True)

In [14]:
df

       age        job
Jenny   25  developer

In [69]:
friends=[{'name':'John','age':15,'job':'student'},
        {'name':'Ben','age':25,'job':'developer'},
        {'name':'Jenny','age':30,'job':'teacher'}]
df=pd.DataFrame(friends,
               columns=['name','age','job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [70]:
df=df.drop(df.index[[0,2]])
df

  name  age        job
1  Ben   25  developer

In [71]:
friends=[{'name':'John','age':15,'job':'student'},
        {'name':'Ben','age':25,'job':'developer'},
        {'name':'Jenny','age':30,'job':'teacher'}]
df=pd.DataFrame(friends,
               columns=['name','age','job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [72]:
df=df[df.age>20]

In [73]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [74]:
df=pd.DataFrame(friends,
               columns=['name','age','job'])

In [75]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [77]:
df=df.drop('age',axis=1)
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [78]:
df=pd.DataFrame(friends,
               columns=['name','age','job'])

In [79]:
df.drop('age',axis=1,inplace=True)

In [80]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher